aabboo'ana
aaboolee
aabooliya
aaca
aacaa
aacana
aacay
aacciis
aacidi
aaciis
aada
aadday
aadhdhaasu
aadhdhabeykku
aadhdhana
aadhdhanaagaa
aadhdhanaassi
aadhdhanaw
aadhdhas
aadhdhayis
aadhdhees
aadhdhenna
aadhdhennaadan
aadhdhi
aadhdhibeenna
aadhdhibookkona
aadhdhida
aadhdhidaba
aadhdhidabaa
aadhdhidi
aadhdhido
aadhdhidoogaa
aadhdhidosona
aadhdhiichchiis
aadhdhiis
aadhdhikko
aadhdhin
aadhdhishin
aadhdhiwodhdhiis
aadhdhiya
aadhdhiyo
aadhdhiyode
aadhdhiyogee
aadhdhiyooba
aadhdhiyosaa
aadhdhiyosay
aadhdhoosona
aadhdida
aadhi
aadiis
aadissanaw
aafgaan
aafo
aafotiis
aafuwa
aafuwara
aagaa
aagee
aagiyaan
aagiyan
aaho
aahonne
aahotettaa
aahotettay
aahuwakko
aahuwan
aahuwappe
aakime
aakimee
aakimettanaw
aakimettiyo
aakimetun
aakimiiddi
aakimiis
aakimiya
aakimiyakko
aakkana
aakkees
aakki
aakkida
aakkidi
aakkido
aakkiiddinne
aakkiis
aakkiya
aakkiyo
aakkiyoodekka
aalettaa
aaliis
aallanttees
aallanttiis
aallanttoosona
aallanttuwa
aammotees
aammotida
aammotiis
aammoy
aammuwa
aamotiis
aan
aanaasu
aani
aaniis
aanne
aannisaa
aannisaanne
aannisaara
aannisi
aannissa
aannissaa
aanno
aannuwa
aanugaa
aappe
aappun
aappunaa
aappunan
aappunay
aappunee
aappuntta
aappunttee
aappunttoo
aapputoo
aapuntta
aara
aarachchuwa
aardvark
aarees
aarettaa
aariis
aaro
aaruwa
aas
aasanawunne
a'ashsho
aassa
aassanawu
aassees
aassi
aassidi
aassiis
aassiya
aassiyogaa
aassiyooga
aata
aatiyoogee
aatoy
aatta
aattaas
aattaasi
aattaasu
aattada
aattadasa
aattana
aattanaassi
aattanaayyoo
aattananaw
aattanaw
aattanawu
aattees
aatteettees
aatti
aattida
aattidaakkonne
aattidi
aattido
aattidosona
aattiiddi
aattiis
aattiiyooga
aattiya
aattiyagaa
aattiyanne
aattiyo
aattiyode
aattiyodenne
aattiyogaa
aattiyogee
aattiyoo
aattiyoobay
aattiyoodenne
aattiyoogaa
aattiyosaa
aattiyosay
aattoosona
aattuttee
aattuutee
aattyioo
aatuwa
aatuwaa
aaw
aawa
aawaa
aawaaayyee
aawaanne
aawaappe
aawaara
aawaassi
aawaatoo
aawadankka
aawan
aawantti
aawassi
aawatetta
aawatettaa
aawatettan
aawatettay
aawatettaynne
aawati
aawatiis
aawatiyagaa
aaway
aawaynne
aawu
aawussi
aaya
aaye
aayee
aayeekko
aayeera
aayeessi
aayen
aayentti
aayetetta
aayetettaa
aayeti
aayetu
aayetuppe
aayi
aayidan
aayiiyye
aayiya
aayiyo
aayiyyoo
aayo
aayoteteeaa
aayotettaa
aayyee
aayyee'ana
aayyeero
aayyeessi
aayyeti
aayyetoonne
aayyiya
aayyiyakka
aayyiyanne
aayyiyo
aayyiyonne
aayyiyoo
abaa
abaaliya
abala
aballiya
abaraadees
abaraadettaa
abaraadiis
abasha
abashaa
abb
abbaa
abbaappe
abbabachcho
abbali
abban
abbattoir
abbayaaniinne
abbee
abbiya
abbiyaappe
abbiyaara
abbiyan
abbiyappe
abbiyara
abbrevated
abbyssinian
abhore
abhorrence
abigaazaa
abiraama
abiraame
'abole'
abraame
abraham's
abridgement
abrogation
abstain
abukaadoosiya
abukaaduwayyoo
abuulla
abyssinica
acaa
acceptability
acceptance
accross
accummulated
accussative
achcha
achchaa
achchaama
achchaara
achchan
achchanaassi
achchay
achchees
achchidi
achchiis
achchiyogee
achene
aciya
acotiis
acoy
acoyiis
acquiringknowledge
actascompetitor
acuwa
acuwan
acuwassi
acuwawa
ad
ada
'ada'
adaaqo
adaariya
adaashiniya
adaba
adabaa
adabenna
adabiis
adabukku
adam's
adaraasaasu
adaraashaa
adaraashan
adaraasiis
adaraasissa
adaraassiya
adaraasuwa
adda
addaa
addaaruwa
addachchi
addaraasha
addaraashaa
addaraashan
adde
addee
addettidosona
addettiis
addettin
addettuwa
addile
addinaa
addiniitaa
addiniitaakka
addiniitay
'addis
addisaaban
addisaabappe
addisaabi
addiya
addle
adduqiyay
adduqqoosona
addussa
addussana
addussanaw
addussanne
adeema
adems
adereti
adhdhiis
adiki
adile
adiliya
adimaasa
adimaasu
adiniitaa
adisaaba
adisaabi
adiya
admessi
adp
adrenalin
adrenalinee
adulteration
adulteress
adumaa
adumaasu
aduqissiis
aduqqees
aduqqidi
aduqqiis
aduqqoosona
adussa
adussaa
adussanne
adussasaa
adussatettaa
adussatettaappe
adussatettay
adussees
adussiis
aduwa
adversarial
adversary's
advesary
aegyptica'
aekeekissida
aerogram
aeroplane
afaid
afalaa
afalay
afare
afarssaataa
afarssaatay
affray
afigaanittaane
afikrkkaa
afilaama
afilaamaa
afilaamay
afirkaappeenne
afirkka
afirkkaa
afirkkan
afiro
afkaato
afkaatoy
afkaatuwa
afkkaatoy
africana
afrikaw
afro
afterbirth
afuluuqiis
afuluuquwa
afunttaa
afutta
afuttaa
afuttay
afutttaa
afuutee
afuutiis
afuutiya
afuxissiis
afuxissiya
afuxxiis
agaagaa
agaasu
agacees
agacida
agaciis
agamasaa
agamasiis
aganaassi
age
agenna
agettaa
agettay
agettiyosaa
agga
aggaaga
aggaagada
aggaagoppa
aggaas
aggaasu
aggada
aggan
aggana
agganaagee
agganabaakko
agganawkka
agganawu
agganee
aggees
aggenna
aggennaadan
aggennan
aggi
aggibayiis
aggibeenna
aggibookko
aggidaakko
aggidi
aggido
aggidoogee
aggidosona
aggii
aggiidoson
aggiigeettees
aggiigenna
aggiigidi
aggiigidosona
aggiigiis
aggiiginne
aggiis
aggikke
aggikkii
aggikko
aggin
agginne
aggiyakko
aggiyo
aggiyooba
aggiyoode
aggiyoogaa
aggokkona
aggokkonna
aggoos
aggoosona
aggoppa
aggravating
aggukku
agiis
agina
aginaa
aginaara
aginaassi
aginan
aginappe
aginata
aginatu
aginay
aginiya
agiyagaa
agiyosaa
agiyosay
agobariya
agobariyan
agozee
'agozia'
agoziya
agriculturalist
agriculturist
agronomist
agunttaa
agunttan
agunttattiya
agunttay
aguppiya
agurettaa
agurettay
aguridi
aguriis
aguwa
aguwappe
aha
ahaa
ahaaya
ahchca
aheeraa
aho
ai
aids
aiis
aisle
aja
ajaa
ajaajje
ajaajjee
ajaajjiis
ajaajjiya
ajaawa
ajabaa
ajabidi
ajabiis
ajanddaa
ajjanddaa
ajjooraa
ajjuutaa
ajora
ajuubaa
akaafaa
akaafan
akaliina
akaraara
akasha
akashaasha
akataa
akatiya
akatiyan
akeeka
akeekaa
akeekaani
akeekaaninne
akeekaanne
akeekaappe
akeekaas
akeekabeennabata
akeekada
akeekadii
akeekan
akeekana
akeekanaadan
akeekanawu
akeekanchcha
akeekay
akeekaykka
akeekaynne
akeekees
akeekenna
akeekennaadan
akeekennan
akeekettanawu
akeekettees
akeekettiyo
akeekettiyooba
akeekettiyoobanne
akeeki
akeekida
akeekidaakko
akeekideta
akeekidi
akeekidinne
akeekido
akeekidoogaa
akeekiichchikko
akeekiis
akeekissees
akeekissiya
akeekite
akeekiya
akeekiyaagaa
akeekiyo
akeekiyoogaa
akeekiyoogaanne
akeekiyooge
akeekiyoogee
akeekiyoowode
akeekkan
akeekkennan
akeekkiyoogaa
akeekoosona
akeekoy
akeekoynne
akeekuwa
akeekuwaayyo
akeekuwappe
akenis
akiliiliya
akirobaatiya
akiroobaatiya
akisuume
akkaa
akkamiis
akkamiya
akkammiis
akkamoy
akkamuwa
akkattiis
akkay
akkeechcho
akkeekaa
akkirssa
akkirssaa
akko
akliiliya
akttere
aktteriya
al
alaa
alaadiya
alaafe
alaafee
alaafetetta
alaafetettaa
alaafetettaappe
alaafiya
alaahees
alaaheessinne
alaahii
alaahiis
alaahuwa
alaas
alaassaa
alabeykke
alalaa
alame
alamee
alamiya
alamiyaagaappe
alamiyaara
alamiyaban
alamiyan
alamiyassi
alana
alanawunne
alanggiya
albbasxxiroosa
albbeemiya
alees
alekisanddere
alenna
alettaa
alettiis
algga
alggaa
alggaappe
alggan
alggay
alibeenna
aliis
alimaaya
alissiis
alissuwa
aliya
aliyaa
aliyaappe
aliyo
aliyoo
aliyoogaa
aliyoogee
aljano
'aljanuwa'
aljjaanuwa
aljjaanuwaw
alkkoole
alkkooliya
alkoole
allaaliya
allaaliyaba
allaallas
allaalle
allaallee
allaallessi
allaalleta
allaalleti
allaalleyyoo
allaalliis
allaalliya
allaalliyan
allaalliyaw
allaalliyawu
allaana
allaanaa
allaaro
allaatte
allaattiqabeessuwa
allaattiya
allaga
allagaa
allagatettaa
allagissanaw
allagissiis
allagissuwa
allanaw
allatta
allattaa
allattaakko
allattaykka
allawdo
allaxissiis
allaxxanawu
allaxxees
allaxxettaa
allaxxettay
allaxxiiddi
allaxxiis
allaxxiyo
allaxxiyooga
alleeqees
alleeqettees
alleeqiis
alleeqissidosona
alleeqissiis
alleeqiyooban
alleeqo
alleeqonne
alleeqotun
alleequwa
alleequwaw
allidosona
alliis
alliqaretti
alliqaridosona
alliqariis
alliqaro
alliqaruwa
allissiis
allknowing
alloted
allpowerful
alluwa
almaazee
almaaziya
almmaazee
almuneemiya
alo
aloolluwa
aloy
althouth
alttiraasawnddiya
aluminium
aluwa
aluwan
aluwassa
am
amaadoo
amaadoy
amaamiis
amaara
amaaratto
amaarattonne
amaarattoy
amaarattuwa
amaarattuwaa
amaarattuwaadan
amaarattuwanne
amaarattuwara
amaaridaagee
amaaridaageeti
amaassalays
amaassalidosona
amaassaliis
amaassaliya
amaassaliyogee
amado
amalanchcha
amalee
amaliis
amaliya
amanttiya
amara
amarata
amarati
amarida
amaridaagaa
amaridaagee
amaridaageeta
amaridaageeti
amaridaageti
amaridaaggaa
amaridabaa
amaridageeta
amassalee
amassment
ambbaa
ambbaanuwa
ambbabeessaa
ambban
ambbatu
ambbatun
ambbatuppe
ambbatuuninne
ambbawkatamaw
ambbay
ambbiya
ambboomaa
ambboomiis
ambbulanssee
ambbulanssiya
ame
ameebaa
ameerikaanetu
amerca
amerikka
amerikkaa
amerkka
amerkkaa
amerkkan
ametettaa
ametettay
amini
amisiliya
amiya
amiyo
ammanaas
ammanabeykke
ammananaadan
ammananaw
ammananawu
ammanays
ammanees
ammaneettenna
ammanennaagaa
ammanettanaw
ammanettees
ammanettenna
ammanettennaaga
ammanettennaagaa
ammanettidaagaa
ammanettidi
ammanettiis
ammanettin
ammanettiya
ammanettiyo
ammanettiyogaa
ammanettiyogee
ammanettiyoogaa
ammanettiyooganne
ammanettoppa
ammanidaageeti
ammanidi
ammaniis
ammanin
ammaniya
ammaniyaa
ammaniyaagaa
ammaniyagaa
ammaniyageeti
ammaniyaro
ammaniyo
ammaniyoba
ammaniyoobanne
ammaniyoogee
ammanna
ammannees
ammannettennaaro
ammannoos
ammano
ammanoos
ammanoosona
ammanoppa
ammanosoona
ammanoy
ammanttada
ammanttana
ammanttanaagee
ammanttanaakko
ammanttanawu
ammanttees
ammanttenna
ammanttennaba
ammanttiis
ammanttikkii
ammanttikko
ammanttiya
ammanttiyaga
ammanttiyageeta
ammanttiyogee
ammanttuwa
ammanuutee
ammanuwa
ammanuwaa
ammanuwaadan
ammanuwaara
ammanuwadan
ammanuwan
ammanuwanne
ammanuwappe
ammanuwawu
ammattana
amni
amorphousness
amotiis
amottees
amottiis
amottiya
amottiyoonne
amottoos
amount
amoy
amoyees
amoyiis
amppada
amppalaa
amppalay
amppettaa
amppidi
amppiis
amppooliya
amputee
amridaba
amridabaa
amridageeta
amuqa
amusaasu
amusiis
amusiya
amuwa
amuwan
amuwappe
an
ana
anaaciya
anaaciyan
anaaciyaw
anaanaasiya
anaappe
anaaxee
anaaxiya
anaaxiyan
anaaxiyassi
anahaa
anahiis
analysis
analyzation
ananoote
anawu
anawukka
anccawsu
anccennan
anccettaa
anccettay
anccettida
ancciis
ancco
anccuwa
ancestors'
anchchati
anchchay
ancients'
and
andor
ane
anee
anggaa
anggaasuwa
anggaawa
anggata
anggati
anggatiis
anggaw
anggilee
anggiliya
anggooliya
anha
anhaa
anhay
anhees
ani
'ani'
anima
animals'
animal's
animoomeetiriya
anjjaas
anjjajja
anjjanaw
anjjetta
anjjettaasu
anjjettana
anjjettanaw
anjjettida
anjjettidaagaa
anjjettidaaro
anjjettidee
anjjettidi
anjjettiis
anjjettiyo
anjjettiyogaa
anjjettiyogaadan
anjjettiyogaw
anjjidi
anjjido
anjjiis
anjjiyoo
anjjiyoogaa
anjjiyoogaappe
anjjullaa
anjjullidosona
anjjulliis
anjjuwa
ankkaa
ankkakka
ankkakkaasu
ankkakkiis
ankkoti
ankkoy
ankkuwa
annaa
annaacanchcha
annaacee
annaacettidosona
annaacettiis
annaacettiyagaa
annaacettiyagee
annaacettiyageetuura
annaaciis
annaaciya
annaaciyan
annaaciyaw
annakki
annan
annay
anne
annee
anni
annidosona
anniis
ano
anointment
anonne
anotakka
anoy
anqqaqulettaa
anqqara
anqqarees
anqqariis
anssoolaa
anssoolay
anssoolaykka
anteenaa
anthrax
antipeople
antonym
antonymous
anttashee
anttashiya
anttashiyara
antteenaa
anttennan
anttettaa
anttettees
anttettiis
anttettiyoy
anttiis
anttin
antto
anttoy
anttuwan
anuca
anuuca
anuufa
anuwa
anuwassi
anwu
anzzaa
anzzay
apartheid
apologised
aportion
appe
appiliya
apportunities
approach
approval
approve
approved
aprocess
aqa
aqaabiya
aqadii
aqanaw
aqaws
aqees
aqi
aqida
aqidaagee
aqidi
aqidosona
aqiis
aqiya
aqiyaageeti
aqiyagaa
aqiyageetussi
aqiyo
aqiyoogaana
aqo
aqofaappe
aqoppa
aqota
aqotaa
aquittal
aquwa
aquwaa
aquwaanne
aquwan
aquwanne
araadaa
araadan
araadanne
araadattanaw
araadattiis
araajjiya
araataa
araatay
arabiya
aracettaa
aracettaypuusee
araciis
araciyogaa
aradda
araddatettaa
araddiis
araddissaa
araddissanaw
araddissees
araddissiis
arajjaataa
aramaniya
aramida
arbba
arbbaabiis
arbbee
arbbi
arborea
archaeologist
archaeologists
archaeology
arcshaped
area
arees
arettaa
argentine
argenttayniya
arggaacaa
arggaacada
arggaacay
arggaaciis
arggaacissiis
argganttaa
arggo
arggobbatto
arggokko
arggonne
arggoora
arggotuuge
arggubbiya
argument
argumentation
argumentative
aridi
ariis
arikiyay
arisaema
ariya
arkki
arkko
arkkooloojee
arkkooloojiya
arkkotiis
arkkoy
arkkuwa
aromaticherb
aromatize
aromatized
aromatizing
arppeellidosona
arppeelliis
arppeelluwa
arqqettaa
arqqiis
arra
arrrived
arshotuugeenne
arshsho
arshshoora
arsonist
arssa
arssaa
arssappenne
aruwa
aruwan
as
asa
asaa
asaaa
asaabaa
asaabonchchana
asaagee
asaakko
asaaninne
asaanne
asaappe
asaara
asaaraa
asaaraka
asaarakka
asaassi
asaayyoo
asaba
asabaa
asadan
asan
asanbbusaa
asanne
asappe
asappenne
asaraa
asaray
asasaappe
asassi
asata
asatetta
asatettaa
asatettay
asatetti
asati
asatikka
asattamaaree
asattuwa
asatu
asatun
asatuppe
asatussi
asaw
asawnne
asawu
asawukka
asawuu
asay
asaykka
asaynne
asaynnee
asayyoo
ascariasis
ascarid
asee
asha
ashaaraa
ashaaruwa
ashame
ashanggo
ashanggoy
ashangguliitee
ashangguliitiya
ashangguluutiya
ashened
ashettaa
ashidosona
ashilaalaasu
ashilaaliis
ashilaalo
ashkkaraa
ashkkarati
ashkkariis
ashkkariyo
ashkke
ashkketettaa
ashkketettan
ashkketettay
ashkkettikko
asho
ashodan
ashonne
ashotiis
ashottees
ashoy
ashoyiis
ashsha
ashshaasu
ashsham
ashshanaw
ashshanwu
ashsharkkii
ashshees
ashshennan
ashshibeenna
ashshido
ashshiis
ashshiya
ashshiyagaa
ashshiyogee
ashsho
ashshoppa
ashuuraa
ashuuraassi
ashuwa
ashuwan
ashuwanne
ashuwappenne
ashuwara
ashuwassi
ashuwawu
asi
asikka
asinne
asirataa
asiyo
aso
asociation
asoo
aspirational
asppalttiya
asppe
assa
assaara
assallo
assanawu
assi
assimilation
assiraalaqaa
asskko
assumma
assy
asttamaare
asttamaaree
asttamaareessi
asttamaarekka
asttamaareta
asttamaareti
asttamaaretikka
asttamaaretikks
asttamaaretinne
asttamaaretu
asttamaaretun
asttamaaretuppe
asttamaaretussinne
asttamaaretuuni
asttamaariya
asttamaariyaanttaara
asttamaariyan
asttamaariyantta
asttamaariyanttoo
asttamaariyappe
asttamaariyassi
asttamaariyawu
asttiranne
asttiyaa
asumma
asummaa
asummatettaa
asummatettay
asuwa
asy
asymmetric
at
ataakilttee
ataakilttiya
ataakilttiyan
ataarike
atalaa
ataraa
ataraynne
atatuyso
ateam
atettaa
atettaanne
atfe
ati
atomiya
atotettaa
atotettay
atree
attaagaa
attaasa
attabay
attacking
attamana
attamettiis
attamiis
attamissanaw
attamissuwa
attamiya
attamiyagaa
attamiyagaassi
attamoy
attamuwa
attana
attanaadan
attanaw
attaychchaasu
attees
attenabaa
attenna
attennaaga
attennaagaa
attennaba
attennabaa
attennan
attes
atti
attida
attidaagaa
attidabaa
attidabatuppe
attido
attidoogaa
attidoogee
attidooro
attidosona
attii
attiichchiis
attiis
attikko
attin
attinin
attinya
attis
attiya
attiyaagaa
attiyagee
attiyogaa
attiyogee
attiyosaa
atto
attomo
attoogaassi
attoogee
attoshin
attuma
attumaa
attumaagaa
attumaasaanne
attumaasanne
attumaasay
attumaasi
attumanne
attumasaynne
attumatettaa
attumatettaynne
aunt's
authentic
autobiographical
autoimmune
autonomous
auwdenne
aw
awa
awaa
awaajjibookkonna
awaajjiis
awaajjiyagaa
awaajjiyogee
awaajjoy
awaajjuwa
awaana
awaanakko
awaanee
awaankka
awaanninne
awaappe
awaaqe
awaaqetiis
awaaqiya
awaasidi
awaasidosona
awaasiis
awaasiya
awan
awanakko
awaninne
awankka
awankko
awanne
awappe
awawu
awaxxees
awaxxiis
awaxxikko
awaxxiyode
awcaacciniya
awcayaa
awcayaasu
awcayiis
awcayuwa
awciya
awddashidosona
awddashiis
awddashiya
awde
awdee
awdekka
awdenne
awdiya
awee
awgaa
awgaakko
awgee
awkko
awlayetiis
awlayiya
awnkko
awnna
awnnii
awnnissi
awnno
awnnokko
awogee
awppe
awraajjaa
awrii
awroophphaa
awrooppaa
awrooppatu
awtiya
awu
awucayin
awude
awudee
awudenne
awudeppe
awudiya
awudiyan
awudiyanne
awudiyappe
awugaa
awugaakko
awugaanakko
awugaappe
awugaara
awugee
awugeenne
awugeeshsha
awugeetakko
awugeetee
awun
awuogee
awuppe
awurooppaa
awurophatu
awuura
awwatettaa
ax
axaaree
axaaretettaa
axaariya
axaariyassi
axe
axiraariis
axiraarissiyay
axiraaro
axiraaruwa
axisenna
axisettees
axisettiis
axisuwa
axum
axuma
axumaa
axuure
axxaa
axxo
ay
ayaanaa
ayba
aybaa
aybaabaa
aybaakkonne
aybaani
aybakka
aybakko
aybakkonne
aybakonne
aybane
aybanne
aybatetota
aybatetta
aybatettaa
aybatettay
aybawu
aybe
aybee
aybeeshsha
aybi
aybiinee
aybiini
aybiiranne
aybin
aybinne
aybippekka
aybissa
aybissakko
aybisse
aybissee
aybissi
aybtettaa
aybyssi
ayde
aydenne
ayfe
ayfebatuppe
ayfebay
ayfee
ayfees
ayfenne
ayfeta
ayfetanne
ayfettiya
ayfetu
ayfida
ayfiis
ayfissidi
ayfiya
ayfiyaa
ayfiyaakko
ayfiyaanne
ayfiyagee
ayfiyan
ayfiyappe
ayfiyara
ayfiyo
ayhudatu
ayi
ayibakka
ayibee
ayibinne
ayishsha
ayiso
ayiya
ayiyye
aykaliya
aykka
aykko
aykkobaa
aylettaa
aylletettaa
aylletettaappe
aylleti
aylletiis
aylleyiis
aylleyiyogaa
aylliis
ayllikko
aylliya
aylliyan
aylliyo
aymala
aymalee
aymo
aymotiis
aymottay
aymottees
aymottiis
aymottiyagaa
aymottiyagee
aymoy
aymuwa
aynne
aynnekka
aynnii
ayohaar
ayoodiniya
ayooha
ayoohaa
ayraa
ayrllandde
aysaaraa
aysaariis
ayso
aysoy
ayssanaw
ayssi
ayssida
ayssiis
ayssinne
ayssiya
ayssiyaa
ayssiyaageeti
ayssiyaanne
ayssiyagaa
ayssiyagee
aysso
aysuwa
aysuwaabaa
aysuwaawu
aysuwan
aysuwappe
ayyaana
ayyaanaa
ayyaanaara
ayyaanaawatettaappe
ayyaanaaxillo
ayyaanadan
ayyaanan
ayyaanawa
ayyaanay
ayyaani
ayyaanu
ayyaanuntta
ayyaanussi
ayye
ayyees
ayyettees
ayyiis
ayyiya
ayyiyo
ayyo
ayyoo
ayyooha
ayyoohaa
ayyuwa
ayzaabiya
ayzziis
azabbaa
azalla
azallatettaa
azalliis
azalssiis
azariis
azazees
azazettanaw
azazettenna
azazettidoogaa
azazettidosona
azazettiis
azazettiya
azazettiyogaa
azazido
azaziis
azazin
azaziyagaa
azaziyagee
azazo
azazota
azazoy
azazuwa
azazziis
azazzuwa
azik
aziki
azina
azinaa
azinaamachchee
azinaanne
azinaappe
azinaara
azinaassinne
azinanne
azinaw
azinay
azinaynne
azini
aziraaree
aziraariya
azzaa
azzanaasukayyottaau
azzanawsu
azzanays
azzaniis
azzaniya
azzaniyakayyottiya
azzano
azzanttiis
azzanttiya
azzanuwa
azzanuwan
azzaqo
b
ba
baa
baaasu
baabiloone
baabire
baabisiis
baabisuwa
baabure
baaburee
baaburiya
baaburiyan
baacaa
baacan
baacay
baaccira
baacciraa
baachchaa
'baachira'
baaci
baada
baaddiqeechchama
baadee
baadees
baadeti
baadettaa
baadii
baadiis
baadine
baadiya
baadoochche
baaduwa
baaeelaa
baa'eelaa
baa'eelaara
baagaa
baaggaara
baahir
baajeetee
baajeetiya
baajeetiyaw
baajiya
baakko
baakkoy
baakkuwa
baako
baala
baalaa
baalaabbaatiya
baalaappe
baalaassi
baalaayyoo
baalan
baalaw
baalay
baali
baalige
baaligetiis
baaligetoppa
baaligiya
baalimoolaa
baalliya
baalliyadan
baalliyan
baalliyara
baalo
baalota
baalotiis
baalotoosona
baaloyiis
baaluwa
baana
baanaa
baanaadan
baanaagee
baanaappe
baanaassaara
baanaassi
baanasay
baanaw
baanawkka
baanawu
baanee
baanne
baappe
baaqqeelaa
baara
baaraa
baarada
baaranddaa
baaranddan
baare
baarettaa
baarigaara
baarigaaraa
baarigaarati
baarigaaraw
baariiddi
baariis
baaro
baarudaa
baas
baasettida
baasettidaagaa
baasettidaakko
baasettidi
baashaariis
baashshukuliyan
baashu
baashukuliya
baasiis
baaso
baasobata
baasobati
baasonne
baasonnee
baasotu
baasoy
baassaa
baassi
baasu
baasuwa
baasuwan
baasuwana
baatan
baatire
baatiriya
baatiya
baattaa
baattay
baa'ula
baa'ulattiis
baawa
baawaa
baawan
baawee
baawiis
baawu
baaxaa
baaxanchchaa
baaxe
baaxeta
baaxetanaw
baaxetanawu
baaxetaydda
baaxetees
baaxetennan
baaxetiis
baaxetiyogaa
baaxetiyoogaa
baaxetiyoogee
baaxetoosona
baaxettanaw
baaxettiyogaappe
baaxettoosona
baaxiya
baaxiyan
baaxxooleba
baaxxoolebaa
baaxxoolee
baaxxooliya
baayaasu
baaye
baayee
baayen
baayidosona
baayiis
baayye
baayyiya
baayyiyo
baayyoo
baaziliiniya
baazzaa
baazzaaninne
baazzaappe
baazzan
baazzatiis
babaa
babagga
babbaasu
babbabuwa
babbanttaa
babbanttay
babbariya
babbettaa
babbiis
babeykke
babeykkii
babies'
baboon's
baby's
bacaallaa
bacca
baccaa
baceessana
baceessiis
baceessuwa
bachelorette
backbite
backbiter
background
backslide
backsliding
backstrap
bacteeria
badala
badalaa
badalaanne
badalaara
badalay
badama
badamoy
badarachchaa
baddaa
baddannaa
baddo
badduwa
badduwaa
badhdheesaa
badhdheesaanne
badhdheesay
badmanered
badmannered
badnaughty
badtempered
ba'e
bagaarakka
baganaa
bagga
baggaa
baggaakka
baggaanne
baggaara
baggaarakka
baggan
baggappe
baggara
baggata
baggati
baggatiya
baggattiya
baggay
baggettiis
baggi
baggiis
bahir
baidi
baiis
ba'iya
ba'iyogee
bakettaa
bakkaa
bakkaaliya
bakkaalo
bakkaara
bakkallaa
bakkannaa
bakkannay
bakkiis
bakteeree
bakteeremiyassi
baktteeriya
baktteeriyemiya
bala
balaa
balaaliya
balaappe
balaas
balaassi
balaayyoo
balada
balakkiyo
balakkoy
balakkuwa
balan
balana
balanchcha
balanchchaa
balanitis
balannaa
balanniis
'balanties
balaqaa
balase
balasiya
balaykka
balbbuqanaw
balbbuqettaa
balbbuqettiis
balbbuqiis
balbbuqiyooga
balbbuqiyoogan
balddee
balddiya
balennan
balettiichchanaakkonne
balettiis
balettiya
balettiyabaa
balettiyabati
balettiyagaa
balettiyageeta
balggiis
balggo
balggoy
balgguwa
balgguwan
bali
'bali
balibakettaas
balibakkiis
balibakkiya
balibakkiyogee
balibakkoynne
balibakkuwa
balibassiya
balidi
balidobay
balidoogaa
balidooge
baliiddi
baliis
balikko
balissiis
baliya
baliyan
baliyogee
balla
ballaa
ballan
ballattidaba
ballay
ballshaped
balqqiis
baltteetaa
baltteetiyo
baluqiya
baluqoy
baluquwa
bambballooma
bambbare
bambbaree
bambbariya
bambbariyan
bamboozle
bamula
bana
banaara
banan
banatettaa
banddiraa
banddiray
banddiya
banddiyan
banddotiis
bandduwa
banggaa
banggaappenne
banggay
bankke
bankkee
bankkettaa
bankkiis
bankkiya
bankkiyan
bankkiyappe
bankkkiya
bannahaa
bannakettaa
bannakkiis
banne
banqqa
banqqaa
banqqatiis
banta
bantta
banttaa
banttaagaa
banttana
banttanaara
banttappe
banttarkka
banttaso
banttason
banttaw
banttawu
baoy
baqaa
baqataa
baqatidosona
baqatiis
baqatissees
baqatiyagaa
baqatiyosaa
baqe
baqee
baqettaa
baqettan
baqettees
baqettiis
baqettiya
baqiis
baqiya
baqqa
baqqaasu
baqqala
baqqanaw
baqqawsu
baqqi
baqqidi
baqqido
baqqidoogee
baqqidosona
baqqiis
baqqiya
baqqiyagaa
baqqiyasan
baqqo
baqqoosona
baqulee
baquliya
baquliyo
baquloti
baquloy
baquluwa
baquluwanne
bara
baraa
baraarettaa
baraariis
baraataa
baraatiis
baraatuwa
barakiinaa
baratiya
barbbarriya
barbbeesuwa
barbbeesuwapiqaade
barchche
barchchetennan
barchcheyiis
barchcheyiyabanne
barchcheyiyabata
barchcheyiyo
barchchiya
barchchiyaa
bare
baree
barettiis
barged
barggaagettaa
barggaagiis
barggaagissiis
barggiya
barggiyan
barggottiis
bargguwa
bari
bariba
baribaa
baribaara
baribeessuwa
bariigaa
bariiro
bariis
bariiso
barimeelliya
barina
barinan
barissi
barissinne
bariya
bariyaa
bariyan
bariyyo
bariyyokka
bariyyoo
barjja
barjjiis
barkka
barkkanne
barkkatettaa
barmeelliyan
barna
baro
barottiis
baroy
barqqaa
barqqidabi
barqqiis
barrister
barssaa
barssaasu
barssi
barssidi
barssiis
barssis
barssoy
barssuwa
barssuwanne
baruwa
barxxaxxa
base
based
bashashiya
bashee
basheenne
bashifulness
bashino
bashiya
bashiyan
bashsha
bashshaa
bashshidi
bashshidosona
bashshiis
bashshiya
bashshoosona
bashuwa
baskettable
bason
basoo
bassaa
bassuwa
basuwa
basuwaw
batettaa
batibatiis
batibatoosona
batibatuwa
battaaliya
battaasu
battidi
battiis
battta
batturee
ba'uwa
baw
baw'ettaa
baw'ida
baw'iis
bawogaa
bawsu
bawtaa
bawtiis
bawu
bawutay
bawwee
bawwiya
baxettaa
baxuuxa
baxuuxi
baxuuxiis
baxuuxuwa
baxxanniis
baxxariya
baxxariyo
baxxiis
baxxiyagaa
bayanabaa
baybo
baydda
baydde
bayida
bayidabaa
bayidosona
bayiis
bayin
bayinna
bayinnaan
bayira
baylibayla
baylibaylaa
baylibayliis
bayna
baynna
baynnaagaa
baynnaagaappe
baynnaakko
baynnaba
baynnabaadan
baynnabaakkonne
baynnan
baynnasaa
baynnasan
baynne
baynni
bayoloojee
bayooloojee
bayooloojiya
bayra
bayraa
bayratiis
bayratiya
bayratu
bayratussi
bayrayiis
bayriyo
bays
baysa
baysaa
bayzettees
bayzettichchana
bayzettiichchana
bayzoy
bayzuwa
bayzuwassi
bayzuwaw
bayzzaasu
bayzzada
bayzzana
bayzzanaw
bayzzaws
bayzzees
bayzzi
bayzzidi
bayzziiddi
bayzziis
bayzzin
bayzziya
bayzziyagaa
bayzziyagee
bayzziyakko
bayzziyo
bayzziyosaa
bayzziyy
bayzzoy
bazettaa
bazzido
bazzidobaa
bazziis
bazzottees
bazzottiis
bazzottiyaa
bazzottiyogaa
bazzoy
bazzuwa
bazzuwan
bbaa
bbee
bbiya
bduussa
be
bea
be'a
beaas
be'aas
be'aasu
beada
be'ada
beadii
be'adii
be'ana
be'anaagee
beanaassi
be'anaassi
beanaw
be'anaw
beautification
beblessed
beceeccula
beckoner
becomehappy
becomeinflated
becomfortable
beconvenient
bedchamber
bedcloth
bedclothes
bedde
bedirty
bedonewell
bedsheets
bedwoven
beeba
beedaaruwa
beeggiis
beeggottiyo
beegotaa
beegotta
beegottaas
beegottees
beegottida
beegottiis
beegottiya
beegoyidaakko
beegoyiis
beelaalaa
beelibeela
beelibeeliis
beelibeeloosona
beelike
beeluwa
beenaadan
beenna
beennaadan
beennaba
beennabee
beennadan
beennan
beera
beeraa
beeraappe
beeray
beero
beerottaas
beerottiis
beeroy
beeruwa
beeruwan
beeruwassi
beeruwayyoo
bees
beessees
beessennabaa
beeswax
beetaa
beetay
beete
beeti
beetiya
beetroot
beettaa
beettana
beettanaadan
beettanee
beettees
beetteesippe
beettenna
beettennabaa
beettennan
beetti
beettida
be'ettida
beettidaba
beettido
beettiiddi
beettiis
beettikko
beettikkoppe
beettiya
beettiyaa
beettiyaaba
beettiyaabata
beettiyaabatanne
beettiyaabatinne
beettiyaba
beettiyabaa
beettiyabata
beettiyabati
beettiyabay
beettiyageeta
beettiyo
beettiyogeeta
beettiyoo
beettiyoode
beettiyoogaa
beettle
beettokkona
beettoosona
beetuwa
beexiya
beexiyan
beexxalaydda
beexxallaasu
beexxalssaa
beez
beezeta
beezummiis
beezunttaa
beflammable
befull
begfavour
beggar's
beginning
behaviour
be'ida
beidaba
beidi
be'idi
beido
be'ido
be'idoogaadan
be'idoogetuppe
be'idosona
be'iiddi
beiis
be'iis
bein
beingnauseating
beings'
be'ite
be'iyagaa
be'iyo
beiyogan
be'iyoogaadan
bekele
belecaa
beletiis
belettaa
beliis
belittlement
belletiis
belliya
belongs
bemany
bendingdown
beni
benibaa
beniigaa
benippe
benjjaamin
benzine
beold
beoos
be'oos
be'oosona
beqeqqa
beqete
berelactant
bergguwa
bergguwan
bersama
besa
besanawu
bese
besettees
besettida
besibollaa
besibollawu
besick
besiya
besiyakka
besluggish
beso
besorry
bessa
bessaal
bessaas
bessaasa
bessada
bessal
bessana
bessanaadan
bessanaassa
bessanaassanne
bessanaw
bessanawu
bessanawunne
bessanwu
bessee
bessees
besseesippe
besseess
bessenna
bessennaaga
bessennaba
bessennabata
bessennabatishin
besses
bessesppe
bessess
bessi
bessidi
bessido
bessidobi
bessidosona
bessii
bessiis
bessin
bessiooga
bessishin
bessiya
bessiyaa
bessiyaaba
bessiyaabata
bessiyaakko
bessiyaba
bessiyabanne
bessiyabata
bessiyabataanne
bessiyabatettaa
bessiyabati
bessiyagaa
bessiyagaadan
bessiyagee
bessiyageta
bessiyakko
bessiyakkone
bessiyakkonne
bessiyakonne
bessiyasan
bessiyay
bessiyo
bessiyoba
bessiyobati
bessiyogaa
bessiyogaadan
bessiyogee
bessiyoo
bessiyoobaa
bessiyooga
bessiyoogaa
bessiyoogaadan
bessiyooganne
bessiyoosa
bessiyosa
bessiyoy
bessokkona
bessokkonna
bessoos
bessoosona
bessuutee
bessuuttee
besuitable
besuwa
betee
betida
betidi
betiis
betissiyaa
betiya
betiyaa
betiyo
betiyonne
betrayedjesus
bettiya
beuwa
be'uwa
beuwappe
be'uwappe
bi
bibeenna
bibookko
bichchaarettaa
bichchaariis
biciriqqi
biddaa
biddanchcha
biddanchchaa
bidday
biddees
biddidi
biddiis
biddiyogee
biddiyooga
bidetta
bidintta
bidinttaa
bidinttay
big
bigeater
bigheaded
bighearted
bigiraa
bigiray
bihshshettaa
bii
biichchido
biichchin
biida
biidaakko
biidaakkonne
biiddi
biidee
biidi
biido
biidosaappe
biidosan
biidosona
biigiis
biikke
biikko
biiloone
biiloonentta
biin
biinnee
biinniya
biinuwa
biiraa
biiray
biiraynne
biire
biiree
biiribiira
biiribiiray
biiribiirees
biiribiiriis
biiriya
biiriyan
biiriyanee
biis
biishin
biisi
biitaa
biitan
biitatuppe
biitta
biittaa
biittaabaakka
biittaagaa
biittaan
biittaana
biittaanne
biittaappe
biittaappee
biittaara
biittaaw
biittaawa
biittaawatettaa
biittaawati
biittaayyoo
biittan
biittassi
biittatakka
biittatettan
biittati
biittatikka
biittatu
biittatun
biittatuppe
biittatuura
biittaw
biittawu
biittay
biittee
biitteen
biitteeppenne
biitteesi
biitten
biitti
biittiya
biittiyaa
biittiyo
biittuppe
biixa
biixi
biixibiixa
biixibiixiis
biixibiixiyogee
bijaamaa
bikilaa
bikiliis
bikkaa
bila
bilaa
bilaana
bilahe
bilahee
bilahiya
bilan
bilanddettiyoonne
bilanddidi
bilanddiis
bilanddiyoogaa
bilanddiyoogee
bilandduwa
bilati
bilattiis
bilay
bilaynne
bilbbuwa
bilbbuwan
bilcciina
bilharziasis
biliharzziya
bililintto
bilingual
billamaa
billi
billy
biloonee
bilooniya
bilooniyan
bin
binddibilliis
binddibilluwa
binddillaasu
binddilliis
binddilssaa
binded
bindedbeam
binjjibinjja
binjjibinjjiis
binjjilla
binjjillattidi
binjjillattiis
binnaana
binnaanaa
binqqiriiraasu
binqqiriiriis
binqqirirssaa
binzzilee
binzziliya
biographical
bira
biraa
biraannaa
biradhdhe
biradhdhee
biradhdheenne
biradhdhees
biradhdhenne
biradhdhettaa
biradhdhetu
biradhdhiis
biradhdhikko
biradhdhiya
biradhdhiyan
biran
birassa
birassaa
birassidi
birassiis
birassuwa
birata
birataa
birataappe
biratay
biray
birayleriya
birayliya
birayyoo
birazziis
birddibillisee
birddibillisiya
birddibillisiyappe
birddilibiseenne
birddilibisiya
birddilibsiya
birddiya
birddiyan
birdfamily
birdhdhees
bird's
birggeediya
birhshshettay
birille
birilliya
birishennan
birishshettay
biro
biron
biroon
biroona
birooni
birooshureti
birr
birrshshidi
birsghshida
birshees
birshetta
birshettaa
birshettata
birshsha
birshshaasu
birshshada
birshshana
birshshanaassinne
birshshanaayyoo
birshshanaw
birshshanawu
birshshees
birshshennan
birshshetta
birshshettaa
birshshettaadan
birshshettaakko
birshshettaanne
birshshettaannee
birshshettaappe
birshshettaara
birshshettaasu
birshshettanaassi
birshshettata
birshshettaw
birshshettawu
birshshettay
birshshettaykka
birshshettees
birshshettennan
birshshetti
birshshettibeenne
birshshettide
birshshettiis
birshshettiya
birshshettiyaaba
birshshettiyoogaa
birshshi
birshshidi
birshshido
birshshidosona
birshshiis
birshshin
birshshiqonccissanawu
birshshishin
birshshiyaa
birshshiyaaba
birshshiyaba
birshshiyagaa
birshshiyakko
birshshiyaro
birshshiyo
birshshiyogee
birshshiyoogaa
birshshiyoogaanne
birshshiyoogaappe
birshshiyoogee
birshshuuttee
birshsiyoogaa
birshsshawsu
birthrate
birxxotidi
birxxottiis
birxxottin
birxxottuwa
bishikiliitiyawu
bishkkiliitee
bishkkiliitiya
bishop's
bishshettaa
biskki
biskkiliitiya
biskkiliitiyan
biskkiliitiyassi
bisrshshanawu
bissuwa
bisuwa
bitaa
bitaachcha
bitabaa
bitanchchaa
bitane
bitanee
bitaniya
bitaniyassi
bitaniyaw
bitaniyayyoo
bitettida
bitettiis
bitiis
bitiyagaa
bitiyara
bitiyaro
bittaa
bittaawaassi
bixaa
bixaalaa
bixaalay
bixaaleettees
bixaaliis
bixe
bixetenna
bixxiriya
biya
biyaaba
biyaabappe
biyaabee
biyaagaa
biyaba
biyabati
biyabatussi
biyagaa
biyagee
biyageeti
biyakkonne
biyiyaakko
biyo
biyogee
biyonaa
biyoo
biyoode
biyooga
biyoogaa
biyoogee
biyoogeenne
biyosaa
biyosaara
biyosi
biyyuwa
bizettaa
bizhggamaa
bizhggamawsu
bizhggamiis
biziis
biziya
bizza
bizzaa
bizzanne
bizzatettay
'blackbeeriya'
blackcolored
blanitis
blemished
blindteat
bloodsucking
blowtorch
boan
boastfulness
bo'atees
boatettaa
boatiis
boattees
boattiis
bobaraa
bobariis
bobariya
bobboodo
bobboxaama
bobboxaamiis
bobed
boborccana
boborcciis
boborccuwa
boccees
bocci
boccidi
bocciiddi
bocciis
bocettaa
bochchaa
bochchana
bochchay
bochchenna
bochchennan
bochchido
bochchidoogee
bochchiis
bochchiya
bochchiyaga
bochchna
bochchoosona
bochchoppa
bochchoy
bociis
bodaa
bodditte
bodditten
bodoojje
body
boge
bogee
bogettiis
boggada
boggana
bogganaw
boggi
boggida
boggidi
boggidoogaa
boggiis
boggiya
boggiyagaa
boggiyageeti
boggiyogaa
bogidosona
bogiya
bogiyappe
bogiyaw
bogiyogee
bohettaa
bohettidaagaa
bohettidabadan
bohettidi
bohettiis
bohidosona
bohiis
bohuwa
boisterousness
bokisiyan
bokkin
bolaaliya
'boladia'
bolay
boldfaced
bolees
bolenna
bolettaasu
bolettiis
boli
boliis
bolikka
boliya
boljjojja
boljjojjiis
boljjojjis
bolkkayiis
bolla
bollaa
bollaakka
bollaana
bollaappe
bollaara
bollaaraa
bollaassika
bollan
bollankka
bollanne
bollappe
bollara
bollatettaa
bollatiya
bollay
bolli
bollibollan
bollikka
bollinne
bollo
bollota
bollotaa
bolloteesi
bollotiis
bollotiya
bollotiyo
bolluwa
bolluwaa
bolo
bolooce
boloqiya
bolqqu
bombbaa
bombbee
bombbiya
boncco
bonccottees
bonccottiis
bonccoy
bonccuwa
bonccuwanne
bonchchanaw
bonchchawsu
bonchchees
bonchchenna
bonchchennaagaa
bonchchettanaw
bonchchettees
bonchchettida
bonchchettiya
bonchchiis
bonchchikke
bonchchissanaw
bonchchissees
bonchchissiyay
bonchchiya
bonchchiyo
bonchchiyooge
bonchcho
bonchchoy
bonchchoynne
bonchchuawa
bonchchuwa
bonchchuwadan
bonddooshe
bonee
bonees
bonggottaa
bonggottiis
bonggoyiis
boniis
boniya
boniyan
bonqqaa
bonqqana
bonqqanchchay
bonqqettaa
bonqqida
bonqqidosona
bonqqiis
bonqqiyagaa
bonqqoy
bonqquwa
bonqquwan
boocco
booccotiis
booddees
booddiis
booddila
booddiliis
booddisa
boodettaa
boodila
boohaa
boohay
boohettiis
booho
boohuwa
boo'iis
boo'iya
booja
boojanaappe
boojiiddi
boojiis
bookettees
bookkadii
bookkaydda
bookkees
bookki
bookkidi
bookkidosona
bookkiis
boolee
boolima
boolimees
boolimiis
boolimissidi
boolimissiis
booliya
boolla
boollaa
boollaara
boolladiya
boonawu
booppa
booqalido
booqalliis
booqalssaa
booqinttaa
booqinttay
boora
booraa
booraassi
booraay
boorammees
boorammiis
booran
booranne
booranttaa
boorantte
boorasaa
boorasenna
boorasiis
boorasiya
boorassiya
boorata
booratussi
booraw
booray
boore
boori
booruwa
booshiina
booshshiis
boosona
boosoolo
boossiis
boossuwa
bootaanee
bootaaniya
bootida
bootiis
bootiyode
bootta
boottaa
boottalle
booxissanaw
booxooxissanawu
booxxida
booxxiis
booyiis
booza
boozaliya
booziis
boppu
boqoqqa
boqoqqiis
boqosiis
boqoso
boqosuwa
boquray
boranaassa
boranawu
boranawunne
borchchiborchcha
borchchiborchchees
borchchiborchchiis
borddolla
bore
boreettees
borettaasu
borettiis
borettiya
bori
borichcha
boride
boriis
borinashettiis
borinashoy
borinashshiis
borinashuwa
borinashuwaawu
boriya
boriyo
boriyoogee
borkkotaa
borkkotada
borkkotiis
borodda
boroddaan
boroddattiis
boroddattuwa
boroodiis
borooduwa
boroqiis
boroqo
boroquwa
boroshsha
boroshshaa
boroshshatiis
boroshshiis
boroyyiis
borsaa
borssaa
borssan
borssay
borssees
borssiis
borsso
borssuwa
borttuwa
borxxoxxa
borxxoxxiis
boshaa
boshan
boshee
bosherettana
bosherettiidi
bosherettiis
bosherettuwa
boshettaasu
boshettees
boshettiis
boshettikko
boss'
botokonuwa
bottiya
bottlecap
bottokonetti
bottokonidi
bottokoniis
bottokoniyooga
bottokonoy
bottokonuwa
bountifulness
bouwa
boxiya
boxooxidi
boxooxiis
boxooxissees
boxooxissidi
boxooxississana
boxooxissiya
boxooxissoosona
boxooxuwa
boxxooxxissa
boyiya
boynaa
boynaanne
boynay
boy's
boyyee
boyyiya
braadisttiya
bradhdhiya
brailler
brandnew
brasiliensis
brawny
bubbuhaa
bubbuntte
bubbuxaasu
bubbuxiis
bubbuxuwa
bubbuxuwan
buddeenaa
buddeenay
buduniya
buffed
buh
buhaa
buhee
buhettees
buhettida
buhettiis
buheyiis
buhiya
buhu
bu'iya
bukaa
bukeesoy
bukeessoy
bukeessuwa
bukkada
bukkana
bukkanaadan
bukkanaagaa
bukkanaappe
bukkanaw
bukkanawu
bukkanna
bukkay
bukkaydda
bukkees
bukkenna
bukkennan
bukki
bukkibeenaagaappe
bukkibeenna
bukkidi
bukkido
bukkidoogee
bukkiidde
bukkiiddi
bukkiis
bukkikko
bukkikkokka
bukkin
bukkishin
bukkiyo
bukkiyogaa
bukkkiis
bula
bulaaliya
bulaasu
bulakkaasa
bulakkiis
bulakko
bulattiis
bulcci
bulcciin
bulchchaa
'bule
bulees
bulhhayiis
bulibulees
bulibulettaa
bulibuliis
buliiddi
buliis
buliya
bulkke
bulla
bullaala
bullaalaa
bullaalees
bullaali
bullaaliis
bullachcha
bullachchaa
bullachchaappe
bullachchaasaappe
bullachchaasay
bullachchaassi
bullachchaawaa
bullachchaawaara
bullachchaayiyo
bullachchaayyoo
bullachchan
bullachchasan
bullachchaw
bullachchiis
bullashettiyarissi
bullattiis
bullee
bullukkuwa
bullunttuwa
bulqqo
bulqqotiis
bulqqoyana
bulqqoyiis
bulqquwa
buluku'a
bululees
bululiis
bululiya
bululiyaaba
bululiyabaa
bululiyode
bululsanawu
bululssaa
buluwa
bulxxettaa
bulxxiis
bulxxiya
bunaayyo
bunchchaasu
bunchchettaa
bunchchiis
bundduruuqaasu
bundduruuqiis
bunee
buniis
buniya
bunjjibunjja
bunjjibunjjiis
bunkkiya
bunkkulaase
bunqqashiis
bunqqashiya
bunssuqa
bunssuqiis
bunuquuqa
bunuquuqiis
buqanaw
buqettaa
buqettana
buqettiis
buqiis
buqura
buquraa
buquraanne
buquradan
buquratu
buquratuppe
buquray
bur
buraaqees
buraaqettaa
buraaqiis
buraaqiya
buraaqoosona
buraariya
buraassaa
buraatiis
buraatuwa
buralleesaa
burcce
burccetiis
burcciya
burccukko
burccukkoy
burccukkuwa
burccukkuwan
burchchiis
burchchiya
burddiya
burggeessaa
burials
burjjiburjjiya
burkkukka
burkkukkiis
burningpain
buro
burqqaasu
burqqida
burqqidi
burqqiis
burqqiya
burttakeeno
burttukaane
burttukaanee
burttukaanetuppe
burttukaaniya
burttukkaane
burutukaanee
burutukaaniya
buruushiya
buruushiyan
buruushshiya
buruxo
burxxakkiis
burxxakkuwa
burxxettaa
burxxiis
burxxu
burxxuxxa
burzzuzzaa
burzzuzziis
busakettaa
busakka
busakkees
busakkiis
bushaashaa
bushaashiya
bushaashiyo
bushbuck
businesswoman
busiya
buskkattiiddi
buskkattiis
buskkiina
bussaa
busstand
busubulliya
busubulliyan
busxxaa
buta
butaa
butanttaa
butanttiya
butatees
butatiis
butcher's
butettaa
butiya
buttidosona
buttiis
buttoy
buttuwa
butulaa
butuli
buturuuqiiddi
buturuuqiis
buu
buucaaliya
buucca
buuccaas
buuccanaayyoo
buuccanaw
buuccarkkii
buuccees
buucceettaa
buuccenna
buuccido
buucciis
buucciyogaappe
buuccoos
buucettida
buuchchaa
buuchchaama
buuchchaappe
buuchchaara
buuchchay
buukku
buulettaa
buullaasu
buullees
buulliis
buullo
buullotiis
buuloy
buuluwa
buuqa
buuqaa
buuqqiis
buuraa
buuraappe
buuraayyo
buurattees
buuriis
buusaawa
buusaawiis
buusettaa
buusha
buushiis
buushiya
buusiis
buussa
buussaa
buussaabaa
buussan
buussawu
buussay
buu'ula
buu'ulattees
buu'ulattiis
buuxa
buuxaa
buuxanne
buuxxanne
buuzuwa
buzo
buzottiis
buzoyiis
buzu
buzy
buzzo
by
byre
c
caa'aa
caage
caagettaa
caaggees
caaggiis
caala
caalenna
caalettaasu
caalettiis
caalida
caaliis
caalikko
caamma
caammaa
caammaappe
caammaara
caammaw
caammay
caana
caanaa
caanana
caananaw
caanappe
caanay
caanettida
caanettiis
caanettiyo
caanidi
caanido
caanidobaa
caaniis
caaniya
caaniyogee
caanuwa
caaqettidosona maacettidosona
caaqettiis
caaqoy
caaqqaasu
caaqqiis
caaqqo
caaquwa
caaratto
caarettaa
caariis
cababe
cabara
cabaraa
cabaray
cabbo
cabbotoosona
cabbottees
cabbottiis
cabboy
cabbuwa
cabitaa
cacaa
cacafaasu
caccafaasu
caccafettanaw
caccafidi
caccafiis
caccafuwa
caccara
cacettaa
cachcha
cachchaa
cachchay
cachchi
cachcho
cachchuwa
cacklingsound
cacuwa
cadaa
cadakettaa
cadakki
cadakkiis
caday
cadda
caddaasu
caddananne
caddanaw
caddaydda
caddayddadawsu
caddenna
caddi
caddidi
caddidosona
caddiis
caddin
caddiya
caddiyagaa
caddiyakko
caddiyogaa
caddos
cadet
cadets
cadettidi
cadettiis
cadhdhekkaasu
cadhdhekkiis
cadhdhiya
cagettaa
caggiis
cahaa
cakkanaw
cakkiis
cakkoos
cal
calaa
calaappe
calabash
calf's
caljjo
callaa
callay
called
calligraphy
calliis
callow
calluses
caltivation
caltural
cambbaa
cambbaasu
cambban
cambbay
cambbiis
camees
cammaakobiya
cammees
cammiis
cammiya
camo
canaa
canccare
canccettaa
canccettaappe
canccettay
cancciis
cancciya
cancciyogaa
cancelled
canes
canggaraariis
caniis
canines
canna
canqquwa
can't
canter
cantered
cantering
canters
caparison
capri
capris
capsize
capsizing
caraa
caray
carbbabattiis
carbbabattoppa
carbbabba
carbbiina
carboncopy
cardamon
carded
cariiyaan
cariya
cariyan
carkkees
carkkiis
carkkin
carkkiyode
carkko
carkkoy
carkkoynne
carkkuwa
carkkuwabaa
carkkuwan
carkkuwappe
carlike
carnivore
carpenter's
carppiis
carqqa
carqqaqqa
carqqattiis
carqqayeettii
carqqayiis
carqqee
carqqiya
carqqiyan
carshshaa
carshshaanne
carshshay
casava
casavah
cashaa
cashaas
cashidosona
cashiis
cashkkiriya
cashshaa
cashshaw
cashshi
cassava
castrate
castrated
castration
catakai
caterpillarlike
cat's
cattle's
cause
causevomit
caveshiding
cawaa
cawattiis
caway
cawayiis
cawlaa
cayada
cayees
cayetaa
cayetay
cayettadii
cayetti
cayettiis
cayidi
cayiis
cayin
cayiyoo
cayiyoobaa
cayyiya
cciis
cebbaa
ceccettaa
ceccidosona
cecciis
cecettaa
ceebbiis
ceebboppa
ceeccaa
ceeccay
ceega
ceegaa
ceegatettaa
ceegati
ceegay
ceeggees
ceeggida
ceeggidabaa
ceeggidi
ceeggiidi
ceeggiis
ceeggiyode
ceeqettidi
ceeqettiis
ceeqettiyooge
ceeqqees
ceeqqiis
ceeqqiyo
ceequwa
ceeriya
ceggennaa
celti
cemetary
cenggeleela
cenggeleelidabaa
cenggeleeliis
cenggereeriis
cenggereeruwa
cenggurasan
cenggurassati
cengguriiddi
cenggurssa
cenggurssaa
cenggurssaabaa
cenggurssaaka
cenggurssaan
cenggurssaanne
cenggurssaappe
cenggurssan
cenggurssata
cenggurssati
cenggurssatu
cenggurssatun
cenggurssay
cenggurssaynne
cenggussan
cengurssaa
cengurssata
center
centre
centurian
ceremoney
cetera
cf
chaarikettiis
chachacha
chafed
chairman's
challenging
'chankuwa'
chapped
character
characteristics
characterstic
charade
chare
charkkiya
charlatan
charlatanlike
charlatanry
charnneelaa
chartteree
chastisement
chatted
chatterbox
chay
chayna
chaynattuwa
chchaa
cheekke
cheekkiyan
cheetahs
chenchagamo
chewable
chickenpox
chickpea
chickpeas
chiefship
chigger
chiggers
chigoe
chii
chikki
childern
childless
children's
child's
chilootaa
chilootan
chipsbroken
chiro
chirography
chiruwa
chlidren
choice
chokkiya
chokkolaatee
chokkolaattee
chokkolette
chomis
chomp
christian's
christ's
chrysolite
churncover
chuwa
cibibettaa
cibibiiis
cichchada
cichchiis
ciciya
cicumcised
cidaa
cidhdhaasu
cidhdhiis
cifettaa
cifiis
cigaa
cigaratte
cigettaa
ciggaara
ciggaaraa
ciggaaratiis
ciggichcha
ciggiiddi
ciggiis
ciggikkii
ciguwa
ciidaa
ciifisi
ciimma
ciimman
ciimmanne
ciimmatettaa
ciimmatettan
ciimmatiis
ciipparssiis
ciiraydda
ciirettaa
ciiriciira
ciiriciiriis
ciiriis
ciiriqa
ciiriyoogan
ciishayneti
ciishayniya
ciishaynnetussi
ciishsha
ciishshaa
ciishshaabaa
ciishshaappe
ciishshanne
ciishshata
ciishshay
ciiyyiis
ciiyyiya
cilaattiya
cilicila
cilicilees
ciliciliis
ciliciliya
ciliciluwa
cililo
cillaaciya
cilooshaa
cilooshi
cilooshiis
cilppaa
cilppan
cilppiya
cima
cimaa
cimaasaa
cimatettaa
cimatettaappe
cimatettaynne
cimati
cimaydda
cimaynne
cimbbaa
cimettenna
cimibeenna
cimiis
cimin
cimiyo
cimmaasu
cimmana
cimmees
cimmennan
cimmeti
cimmidi
cimmiis
cimmiiseeyettiis
cimmiya
cimmiyagaa
cimo
cimuwa
cina
cinashshaa
cincca
cinccanne
cinccatettaa
cinccatettay
cincciis
cinccoosona
cinch
cinched
cinggaa
cinggada
cinggees
cinggiis
cinggiriishettaa
cinggiriishiis
cippayiis
cippiya
ciqqaa
ciqqaashuumiya
ciqqattiis
ciraa
ciraacuwa
cirashuwa
circumcised
cirdhdhiina
ciroshuwadan
ciroy
cirppiis
cirppinttettaasu
cirppinttiis
cirppippa
cirqqiqqa
ciruwa
cishshiina
cita
citaa
citaappe
citaara
citaassi
citan
citatu
citatuppe
citay
cittayiis
cittuwa
citzen
citzenship
civetcat
ciyyiya
cizhzhattiis
cizhzhiina
clans
clapped
clapper
clarfy
class
clerk's
climp
clingy
cloth's
clowned
clustering
coa
coaa
coagulated
coagulates
coagulation
coatettaa
coayiis
cob
cobs
cocila
cockerel
coddling
code
codification
codiya
cofoshuwa
cogochchiis
cogochettaa
cogoshettaa
coherance
coiis
coitus
colbbayettaa
colbbayiis
colbbuwa
colbbuwan
coldish
colobus
colonialism
colostrum
colour
coloured
combbayidi
combbayiis
combbiina
combust
commanderinchief
commited
commiting
communicable
compare
comparing
comparsion
composing
comppiwteriya
comprehension
comunication
cona
conaasu
conccissees
conccorotiya
conchcha
conchchaa
conchchaw
conchchiis
conchchuwa
conclusion
concocted
concrete
condominium
conical
conjunctivitis
conn
connecter
connotation
conoqayiis
conoqayuwa
consciencious
consevative
constipation
content
context
contextualizing
continously
contrasting
convulsed
coo
coocee
coociya
coociyan
coociyappe
coodhdhettiis
coodhdhiya
cooga
coogi
cooiya
cookedmeat
coommaasu
coommanaagee
coommanaw
coommayis
coommidi
coommiis
coommishin
coommiyooge
coommiyoogee
coorrattiis
cooshshaa
cooshshay
cooshshiis
cooshshiya
cooyees
cooyidi
cooyido
cooyiis
cooyiya
cooyiyode
cophishuwa
coppayada
coppayiis
coppiya
cora
coraa
coraba
corabaa
corasaappe
coratettaa
coratettaanne
coratettay
corati
coratti
corattida
corattidi
corattido
corattidoogaappe
corattiis
corattiya
corattiyaa
coray
corayanawu
corayiis
corayissuwa
corayiyoogee
corayuwa
corbbiina
corbbobattiis
corbbobayiis
corbbobiina
corddodayiis
corddodiina
cordia
core
corggochchidi
corggochchiis
corggochuwa
coriis
cororattiis
coroshiis
corphphayiis
corphphu
corppoppa
corppoppiis
corrattiis
corriina
corrugated
corta
costy
cou
co''u
couldn't
councilor
country's
coverd
covert
covertness
cowards
cows'
cow's
cowshed
coy
cozhzhattiis
cozhzhiina
crablouse
crammed
crescentshaped
crevasse
crick
criteria
criticizable
crossbeam
crosseyed
croton
crowbar
crsis
cubbo
cubbuwa
cubit
cubiya
cubiyan
cuccumi
cuccumiis
cuccumo
cuccumuwa
cuchchaa
cuchchaasu
cuchchanaappe
cuchchay
cuchchiiddi
cuchchiis
cuchchiya
cuchchiyo
cuchchiyogee
cucunttaanawu
cud
cuddling
cudtard
cugettanaadan
cuggiis
cuguddiis
cuguddoppite
cugudettaa
cugudiis
cugunttaa
cuguwa
cuhettidi
cuhuwan
cumin
cunccallee
cunccalliya
cuniya
cupidity
cupola
cuqqunniya
curdled
curqqaa
curqqan
curqqatees
curqqattiis
curqqay
curqqquqqiis
curqquuqa
curqquuqiis
curtain
cushisseettees
cuspidor
cut
cuuca
cuucaa
cuuce
cuuchchaa
cuuciis
cuucumaa
cuucumay
cuudhdhees
cuudhdhida
cuudhdhiis
cuukkuwa
cuulettiis
cuullana
cuullettaa
cuullettada
cuulli
cuullido
cuullidosona
cuulliis
cuullis
cuuphettaa
cuuphiis
cuurees
cuurettaa
cuuriis
cuutting
cuwaa
cuwattees
cuwattiis
cuway
cuwayiis
cuwayikko
cuwayiyo
cv
d
da
daa
daabbetanne
daabboy
daabbuwa
daabbuwanne
daabbuwappe
daabbuwara
daabidaaba
daabidaabaa
daabidaabiis
daabidaabuwa
daabula
daabulaa
daabulida
daabuliis
daabuwara
daachchuwa
daachchuwan
daaddaa
daadirettaa
daadiriis
daadulmatiis
daadumatoosona
daadumatuwa
daafa
daafaa
daafaabaa
daafaappe
daafaayyo
daafabaa
daafan
daafappe
daafay
daafettaa
daafettiis
daafiis
daafikka
daafiya
daafoy
daafura
daafuraa
daafuraas
daafuraasu
daafuranchcha
daafuri
daafurida
daafuridi
daafurido
daafuriis
daafuriyo
daafuriyoogaa
daafurssanawu
daafurssees
daafurssenna
daafurssiis
daafurssiya
daafurssiyaananne
daafurssiyo
daagaa
daaggees
daaggiis
daahaa
daahaasu
daahada
daahettaa
daahettidi
daahettiis
daakettiis
daakettiyoogaa
daakiyiyee
daakiyiyo
daakkiis
daakkiyyiya
daakkiyyiyo
daakkuwa
daala
daalaa
daalay
daalees
daaliis
daaliyo
daaliyode
daallamiis
daama
daana
daanaa
daanaadan
daanaw
daanay
daaninne
daannaa
daannata
daannati
daannatiis
daannatuwa
daannay
daaqooniya
daaraginddiya
daare
daarettaa
daariis
daarinchchaa
daarinchchan
daarinchchappe
daaro
daasa
daaseti
daashshaa
daasidosona
daasiis
daasiya
daassaa
daassay
daattaa
daa'uwa
daaxxanaw
daaxxawsu
daaxxiis
daayees
daayettaa
daayido
daayiis
dab
daba
dabaa
dabaabaa
dababbiya
dabaliya
dabanchchaa
dabanchchati
dabari
dabariina
dabay
dabbaa
dabbakkettiis
dabbakkiis
dabbakkuwa
